ERP.belugaerp/src/Enums/бг_ИсточникиЦеновойГруппы/бг_ИсточникиЦеновойГруппы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бг_ИсточникиЦеновойГруппы</name>
  <enumValues>
    <name>SKU_MT</name>
  </enumValues>
  <enumValues>
    <name>Номенклатура</name>
  </enumValues>
  <enumValues>
    <name>BrandMT</name>
  </enumValues>
  <enumValues>
    <name>BrandTM</name>
  </enumValues>
  <enumValues>
    <name>Вкус</name>
  </enumValues>
  <enumValues>
    <name>Класс</name>
  </enumValues>
  <enumValues>
    <name>Проект</name>
  </enumValues>
  <enumValues>
    <name>ЦеноваяГруппа</name>
  </enumValues>
  <enumValues>
    <name>Смешанный</name>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Enums/бг_ИсточникиЦеновойГруппы/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция НастройкиПолейЗапроса() Экспорт
	НастройкиПолей = Новый Соответствие;
	
	НастройкиПолей.Вставить(
		ЦеноваяГруппа,
		НоваяНастройкаПоля("ЦеноваяГруппа", "ЦеноваяГруппа", "СправочникСсылка.ЦеновыеГруппы")
	);
	
	НастройкиПолей.Вставить(
		SKU_MT,
		НоваяНастройкаПоля("бг_SKU_MT", "ТоварнаяКатегория.бг_СкюМТ", "СправочникСсылка.бг_ЕК_СКЮ_СкюМТ")
	);

	НастройкиПолей.Вставить(
		Номенклатура,
		НоваяНастройкаПоля("Номенклатура", "Ссылка", "СправочникСсылка.Номенклатура")
	);
	
	НастройкиПолей.Вставить(
		BrandMT,
		НоваяНастройкаПоля("бг_BrandMT", "ТоварнаяКатегория.бг_Бренд.бг_БрендМТ", "СправочникСсылка.бг_ЕК_Бренды_БрендыМТ")
	);
	
	НастройкиПолей.Вставить(
		Класс,
		НоваяНастройкаПоля("бг_Класс", "ТоварнаяКатегория.бг_Класс", "СправочникСсылка.бг_ЕК_СКЮ_Классы")
	);
	
	НастройкиПолей.Вставить(
		Вкус,
		НоваяНастройкаПоля("бг_Вкус", "ТоварнаяКатегория.бг_Вкус",  "СправочникСсылка.бг_ЕК_СКЮ_Вкусы")
	);
	
	НастройкиПолей.Вставить(
		Проект,
		НоваяНастройкаПоля("бг_Проект", "ТоварнаяКатегория.бг_Бренд.бг_Проект", "СправочникСсылка.Проекты")
	);
	
	НастройкиПолей.Вставить(
		BrandTM,
		НоваяНастройкаПоля("бг_BrandTM", "ТоварнаяКатегория.бг_Бренд.бг_БрендТМ", "СправочникСсылка.бг_ЕК_Бренды_БрендыТМ")
	);
	
	НастройкиПолей.Вставить(
		Смешанный,
		НоваяНастройкаПоля("Смешанный", "ТоварнаяКатегория.бг_Бренд.бг_БрендТМ", "СправочникСсылка.бг_ЕК_Бренды_БрендыТМ")
	);

	Возврат НастройкиПолей;
	
КонецФункции

Функция ОписаниеСоставногоТипаИсточников() Экспорт
	
	НастройкиПолей   = НастройкиПолейЗапроса();
	СоставТипаГруппы = Новый Массив;
	Для каждого НастройкаПоля из НастройкиПолей Цикл
		СоставТипаГруппы.Добавить(НастройкаПоля.Значение.Тип);
	КонецЦикла;
	
	Возврат Новый ОписаниеТипов(СоставТипаГруппы);
	
КонецФункции

Функция РодительныеПадежиМножестенногоЧисла() Экспорт
	
	Настройки = Новый Соответствие;
	Настройки.Вставить(SKU_MT,        Строка(SKU_MT));
	Настройки.Вставить(Номенклатура,  Строка(Номенклатура));
	Настройки.Вставить(BrandMT,       НСтр("ru = 'брендов MT'; en = 'brands MT'"));
	Настройки.Вставить(BrandTM,       НСтр("ru = 'брендов TM'; en = 'brands TM'"));
	Настройки.Вставить(Вкус,          НСтр("ru = 'вкусов'; en = 'flavours'"));
	Настройки.Вставить(Класс,         НСтр("ru = 'классов'; en = 'classes'"));
	Настройки.Вставить(Проект,        НСтр("ru = 'проектов'; en = 'projects'"));
	Настройки.Вставить(ЦеноваяГруппа, НСтр("ru = 'ценовых групп'; en = 'price groups'"));
	
	Возврат Настройки;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НоваяНастройкаПоля(Имя, Путь, ИмяТипа)
	Возврат Новый Структура("Имя,Путь,Тип", Имя, Путь, Тип(ИмяТипа));
КонецФункции

#КонецОбласти
